src/TaskManager/src/Catalogs/мзМетоды/мзМетоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мзМетоды</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидМетода</name>
    <type>
      <types>EnumRef.мзВидыМетодов</types>
    </type>
  </attributes>
  <attributes>
    <name>Алгоритм</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяМетода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/TaskManager/src/Catalogs/мзМетоды/ManagerModule.bsl
// Метод уникален.
// 
// Параметры:
//  ИмяМетода - Строка
//  Ссылка - СправочникСсылка.мзМетоды, игнорируется при поиске дублей
// 
// Возвращаемое значение:
// 	Булево 
Функция МетодУникален(ИмяМетода, Ссылка = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	мзМетоды.Ссылка
	|ИЗ
	|	Справочник.мзМетоды КАК мзМетоды
	|ГДЕ
	|	мзМетоды.Ссылка <> &Ссылка
	|	И мзМетоды.ИмяМетода = &ИмяМетода
	|	И мзМетоды.Использование";
	Запрос.УстановитьПараметр("ИмяМетода", ИмяМетода);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Пустой();
	
КонецФункции
